src/main/resources/xml/accommodationBatchServicePort/stageRoomingListReservationData/stageRoomingListReservationData.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bat="http://batch.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <bat:stageRoomingListReservationData>
         <request>
            <!--Optional:-->
            <processId>?</processId>
            <!--Optional:-->
            <processName>?</processName>
            <!--Optional:-->
            <templateId>?</templateId>
            <!--Zero or more repetitions:-->
            <roomingListReservationTOList>
               <!--Optional:-->
               <reservationNumber>?</reservationNumber>
               <!--Optional:-->
               <processingDate>?</processingDate>
               <!--Optional:-->
               <rowNumber>?</rowNumber>
               <checkShared>?</checkShared>
               <renderFlag>?</renderFlag>
               <checkReservation>?</checkReservation>
               <checked>?</checked>
               <!--Optional:-->
               <inventoryOverrideReasonCode>?</inventoryOverrideReasonCode>
               <!--Optional:-->
               <inventoryOverrideContactName>?</inventoryOverrideContactName>
               <!--Zero or more repetitions:-->
               <reservationDataList>
                  <!--Optional:-->
                  <dateValue>?</dateValue>
                  <!--Optional:-->
                  <stringValue>?</stringValue>
                  <!--Optional:-->
                  <numericValue>?</numericValue>
                  <!--Optional:-->
                  <fieldOrderNo>?</fieldOrderNo>
                  <!--Optional:-->
                  <fieldName>?</fieldName>
                  <!--Optional:-->
                  <fieldId>?</fieldId>
               </reservationDataList>
               <!--Zero or more repetitions:-->
               <errorTOList>
                  <!--Optional:-->
                  <description>?</description>
                  <!--Optional:-->
                  <date>?</date>
                  <!--Optional:-->
                  <code>?</code>
                  <!--Optional:-->
                  <errorType>?</errorType>
               </errorTOList>
            </roomingListReservationTOList>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </bat:stageRoomingListReservationData>
   </soapenv:Body>
</soapenv:Envelope>